# YOLOv5s with ConvNext-Tiny Backbone

nc: 80
depth_multiple: 0.67
width_multiple: 0.75

anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

# Backbone
backbone:
  [[-1, 1, ConvNextTiny, [512]],    # 0: P5 output, 512 channels
  ]

head:
  # NOTE: First arg in Conv is OUTPUT channels, parser auto-calculates input
  # But parser thinks input is 3 (original image channels)
  # We need to force correct channel counts
  
  [[-1, 1, Conv, [256, 1, 1]],              # 1: 512->256 (P5 processing)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 2: Upsample
   
   [-1, 1, ConvNextP4, [256]],              # 3: Get P4 (256 channels) - ADDED output channel hint
   [[-1, 2], 1, Concat, [1]],               # 4: Concat: 256+256=512
   [-1, 3, C3, [256, False]],               # 5: C3 512->256
   
   [-1, 1, Conv, [128, 1, 1]],              # 6: 256->128
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 7: Upsample
   
   [-1, 1, ConvNextP3, [128]],              # 8: Get P3 (128 channels) - ADDED output channel hint
   [[-1, 7], 1, Concat, [1]],               # 9: Concat: 128+128=256
   [-1, 3, C3, [128, False]],               # 10: C3 256->128 - P3/8-small
   
   # Bottom-up PAN pathway
   [-1, 1, Conv, [128, 3, 2]],              # 11: Downsample 128->128
   [[-1, 5], 1, Concat, [1]],               # 12: Concat with layer 5: 128+256=384 -> WRONG!
   [-1, 3, C3, [256, False]],               # 13: C3 - P4/16-medium
   
   [-1, 1, Conv, [256, 3, 2]],              # 14: Downsample
   [[-1, 1], 1, Concat, [1]],               # 15: Concat with layer 1: 256+256=512
   [-1, 3, C3, [512, False]],               # 16: C3 - P5/32-large
   
   [[10, 13, 16], 1, Detect, [nc, anchors]],  # 17: Detect
  ]